nxp-mcuxpresso/mcux-sdk/devices/MKE13Z9/MKE13Z9.h
#define MTB_DEVICECFG_DEVICECFG_MASK             (0xFFFFFFFFU)
#define MTB_DEVICECFG_DEVICECFG_SHIFT            (0U)
/*! DEVICECFG - DEVICECFG */
#define MTB_DEVICECFG_DEVICECFG(x)               (((uint32_t)(((uint32_t)(x)) << MTB_DEVICECFG_DEVICECFG_SHIFT)) & MTB_DEVICECFG_DEVICECFG_MASK)
/*! @} */

/*! @name DEVICETYPID - Device Type Identifier Register */
/*! @{ */

#define MTB_DEVICETYPID_DEVICETYPID_MASK         (0xFFFFFFFFU)
#define MTB_DEVICETYPID_DEVICETYPID_SHIFT        (0U)
/*! DEVICETYPID - DEVICETYPID */
#define MTB_DEVICETYPID_DEVICETYPID(x)           (((uint32_t)(((uint32_t)(x)) << MTB_DEVICETYPID_DEVICETYPID_SHIFT)) & MTB_DEVICETYPID_DEVICETYPID_MASK)
/*! @} */

/*! @name PERIPHID - Peripheral ID Register */
/*! @{ */

#define MTB_PERIPHID_PERIPHID_MASK               (0xFFFFFFFFU)
#define MTB_PERIPHID_PERIPHID_SHIFT              (0U)
/*! PERIPHID - PERIPHID */
#define MTB_PERIPHID_PERIPHID(x)                 (((uint32_t)(((uint32_t)(x)) << MTB_PERIPHID_PERIPHID_SHIFT)) & MTB_PERIPHID_PERIPHID_MASK)
/*! @} */

/* The count of MTB_PERIPHID */
#define MTB_PERIPHID_COUNT                       (8U)

/*! @name COMPID - Component ID Register */
/*! @{ */

#define MTB_COMPID_COMPID_MASK                   (0xFFFFFFFFU)
#define MTB_COMPID_COMPID_SHIFT                  (0U)
/*! COMPID - Component ID */
#define MTB_COMPID_COMPID(x)                     (((uint32_t)(((uint32_t)(x)) << MTB_COMPID_COMPID_SHIFT)) & MTB_COMPID_COMPID_MASK)
/*! @} */

/* The count of MTB_COMPID */
#define MTB_COMPID_COUNT                         (4U)


/*!
 * @}
 */ /* end of group MTB_Register_Masks */


/* MTB - Peripheral instance base addresses */
/** Peripheral MTB base address */
#define MTB_BASE                                 (0xF0000000u)
/** Peripheral MTB base pointer */
#define MTB                                      ((MTB_Type *)MTB_BASE)
/** Array initializer of MTB peripheral base addresses */
#define MTB_BASE_ADDRS                           { MTB_BASE }
/** Array initializer of MTB peripheral base pointers */
#define MTB_BASE_PTRS                            { MTB }

/*!
 * @}
 */ /* end of group MTB_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- MTBDWT Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MTBDWT_Peripheral_Access_Layer MTBDWT Peripheral Access Layer
 * @{
 */

/** MTBDWT - Register Layout Typedef */
typedef struct {
  __I  uint32_t CTRL;                              /**< DWT Control Register, offset: 0x0 */
       uint8_t RESERVED_0[28];
  __IO uint32_t COMP0;                             /**< DWT Comparator Register, offset: 0x20 */
  __IO uint32_t MASK0;                             /**< DWT Comparator Mask Register, offset: 0x24 */
  __IO uint32_t FCT0;                              /**< DWT Comparator Function Register 0, offset: 0x28 */
       uint8_t RESERVED_1[4];
  __IO uint32_t COMP1;                             /**< DWT Comparator Register, offset: 0x30 */
  __IO uint32_t MASK1;                             /**< DWT Comparator Mask Register, offset: 0x34 */
  __IO uint32_t FCT1;                              /**< DWT Comparator Function Register 1, offset: 0x38 */
       uint8_t RESERVED_2[452];
  __IO uint32_t TBCTRL;                            /**< DWT Trace Buffer Control Register, offset: 0x200 */
       uint8_t RESERVED_3[3524];
  __I  uint32_t DEVICECFG;                         /**< Device Configuration Register, offset: 0xFC8 */
  __I  uint32_t DEVICETYPID;                       /**< Device Type Identifier Register, offset: 0xFCC */
  __I  uint32_t PERIPHID[8];                       /**< Peripheral ID Register, array offset: 0xFD0, array step: 0x4 */
  __I  uint32_t COMPID[4];                         /**< Component ID Register, array offset: 0xFF0, array step: 0x4 */
} MTBDWT_Type;

/* ----------------------------------------------------------------------------
   -- MTBDWT Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MTBDWT_Register_Masks MTBDWT Register Masks
 * @{
 */

/*! @name CTRL - DWT Control Register */
/*! @{ */

#define MTBDWT_CTRL_DWTCFGCTRL_MASK              (0xFFFFFFFU)
#define MTBDWT_CTRL_DWTCFGCTRL_SHIFT             (0U)
/*! DWTCFGCTRL - DWT configuration controls */
#define MTBDWT_CTRL_DWTCFGCTRL(x)                (((uint32_t)(((uint32_t)(x)) << MTBDWT_CTRL_DWTCFGCTRL_SHIFT)) & MTBDWT_CTRL_DWTCFGCTRL_MASK)

#define MTBDWT_CTRL_NUMCMP_MASK                  (0xF0000000U)
#define MTBDWT_CTRL_NUMCMP_SHIFT                 (28U)
/*! NUMCMP - Number of comparators */
#define MTBDWT_CTRL_NUMCMP(x)                    (((uint32_t)(((uint32_t)(x)) << MTBDWT_CTRL_NUMCMP_SHIFT)) & MTBDWT_CTRL_NUMCMP_MASK)
/*! @} */

/*! @name COMP0 - DWT Comparator Register */
/*! @{ */

#define MTBDWT_COMP0_COMP_MASK                   (0xFFFFFFFFU)
#define MTBDWT_COMP0_COMP_SHIFT                  (0U)
/*! COMP - Reference value for comparison */
#define MTBDWT_COMP0_COMP(x)                     (((uint32_t)(((uint32_t)(x)) << MTBDWT_COMP0_COMP_SHIFT)) & MTBDWT_COMP0_COMP_MASK)
/*! @} */

/*! @name MASK0 - DWT Comparator Mask Register */
/*! @{ */

#define MTBDWT_MASK0_MASK_MASK                   (0x1FU)
#define MTBDWT_MASK0_MASK_SHIFT                  (0U)
/*! MASK - MASK */
#define MTBDWT_MASK0_MASK(x)                     (((uint32_t)(((uint32_t)(x)) << MTBDWT_MASK0_MASK_SHIFT)) & MTBDWT_MASK0_MASK_MASK)
/*! @} */

/*! @name FCT0 - DWT Comparator Function Register 0 */
/*! @{ */

#define MTBDWT_FCT0_FUNCTION_MASK                (0xFU)
#define MTBDWT_FCT0_FUNCTION_SHIFT               (0U)
/*! FUNCTION - Function
 *  0b0000..Disabled.
 *  0b0001-0b0011..Reserved. Any attempts to use this value results in UNPREDICTABLE behavior.
 *  0b0100..Instruction fetch.
 *  0b0101..Data operand read.
 *  0b0110..Data operand write.
 *  0b0111..Data operand (read + write).
 *  0b1000-0b1111..Reserved. Any attempts to use this value results in UNPREDICTABLE behavior.
 */
#define MTBDWT_FCT0_FUNCTION(x)                  (((uint32_t)(((uint32_t)(x)) << MTBDWT_FCT0_FUNCTION_SHIFT)) & MTBDWT_FCT0_FUNCTION_MASK)

#define MTBDWT_FCT0_DATAVMATCH_MASK              (0x100U)
#define MTBDWT_FCT0_DATAVMATCH_SHIFT             (8U)
/*! DATAVMATCH - Data Value Match
 *  0b0..Perform address comparison.
 *  0b1..Perform data value comparison.
 */
#define MTBDWT_FCT0_DATAVMATCH(x)                (((uint32_t)(((uint32_t)(x)) << MTBDWT_FCT0_DATAVMATCH_SHIFT)) & MTBDWT_FCT0_DATAVMATCH_MASK)

#define MTBDWT_FCT0_DATAVSIZE_MASK               (0xC00U)
#define MTBDWT_FCT0_DATAVSIZE_SHIFT              (10U)
/*! DATAVSIZE - Data Value Size
 *  0b00..Byte.
 *  0b01..Halfword.
 *  0b10..Word.
 *  0b11..Reserved. Any attempts to use this value results in UNPREDICTABLE behavior.
 */
#define MTBDWT_FCT0_DATAVSIZE(x)                 (((uint32_t)(((uint32_t)(x)) << MTBDWT_FCT0_DATAVSIZE_SHIFT)) & MTBDWT_FCT0_DATAVSIZE_MASK)

