nxp-mcuxpresso/mcux-sdk/devices/MKE13Z9/MKE13Z9.h
#define TSI_SSC0_SSC_MODE_MASK                   (0x6000000U)
#define TSI_SSC0_SSC_MODE_SHIFT                  (25U)
/*! SSC_MODE - SSC_MODE
 *  0b00..Using PRBS method generating SSC output bit.
 *  0b01..Using up-down counter generating SSC output bit.
 *  0b10..SSC function is disabled.
 *  0b11..NC.
 */
#define TSI_SSC0_SSC_MODE(x)                     (((uint32_t)(((uint32_t)(x)) << TSI_SSC0_SSC_MODE_SHIFT)) & TSI_SSC0_SSC_MODE_MASK)

#define TSI_SSC0_PRBS_OUTSEL_MASK                (0xF0000000U)
#define TSI_SSC0_PRBS_OUTSEL_SHIFT               (28U)
/*! PRBS_OUTSEL - PRBS_OUTSEL
 *  0b0000..NC.
 *  0b0001..NC.
 *  0b0010..The length of the PRBS is 2.
 *  0b0011..The length of the PRBS is 3.
 *  0b0100..The length of the PRBS is 4.
 *  0b0101..The length of the PRBS is 5.
 *  0b0110..The length of the PRBS is 6.
 *  0b0111..The length of the PRBS is 7.
 *  0b1000..The length of the PRBS is 8.
 *  0b1001..The length of the PRBS is 9.
 *  0b1010..The length of the PRBS is 10.
 *  0b1011..The length of the PRBS is 11.
 *  0b1100..The length of the PRBS is 12.
 *  0b1101..The length of the PRBS is 13.
 *  0b1110..The length of the PRBS is 14.
 *  0b1111..The length of the PRBS is 15.
 */
#define TSI_SSC0_PRBS_OUTSEL(x)                  (((uint32_t)(((uint32_t)(x)) << TSI_SSC0_PRBS_OUTSEL_SHIFT)) & TSI_SSC0_PRBS_OUTSEL_MASK)
/*! @} */

/*! @name SSC1 - TSI SSC register 1 */
/*! @{ */

#define TSI_SSC1_PRBS_SEED_LO_MASK               (0xFFU)
#define TSI_SSC1_PRBS_SEED_LO_SHIFT              (0U)
/*! PRBS_SEED_LO - PRBS_SEED_LO */
#define TSI_SSC1_PRBS_SEED_LO(x)                 (((uint32_t)(((uint32_t)(x)) << TSI_SSC1_PRBS_SEED_LO_SHIFT)) & TSI_SSC1_PRBS_SEED_LO_MASK)

#define TSI_SSC1_PRBS_SEED_HI_MASK               (0xFF00U)
#define TSI_SSC1_PRBS_SEED_HI_SHIFT              (8U)
/*! PRBS_SEED_HI - PRBS_SEED_HI */
#define TSI_SSC1_PRBS_SEED_HI(x)                 (((uint32_t)(((uint32_t)(x)) << TSI_SSC1_PRBS_SEED_HI_SHIFT)) & TSI_SSC1_PRBS_SEED_HI_MASK)

#define TSI_SSC1_PRBS_WEIGHT_LO_MASK             (0xFF0000U)
#define TSI_SSC1_PRBS_WEIGHT_LO_SHIFT            (16U)
/*! PRBS_WEIGHT_LO - PRBS_WEIGHT_LO */
#define TSI_SSC1_PRBS_WEIGHT_LO(x)               (((uint32_t)(((uint32_t)(x)) << TSI_SSC1_PRBS_WEIGHT_LO_SHIFT)) & TSI_SSC1_PRBS_WEIGHT_LO_MASK)

#define TSI_SSC1_PRBS_WEIGHT_HI_MASK             (0xFF000000U)
#define TSI_SSC1_PRBS_WEIGHT_HI_SHIFT            (24U)
/*! PRBS_WEIGHT_HI - PRBS_WEIGHT_HI */
#define TSI_SSC1_PRBS_WEIGHT_HI(x)               (((uint32_t)(((uint32_t)(x)) << TSI_SSC1_PRBS_WEIGHT_HI_SHIFT)) & TSI_SSC1_PRBS_WEIGHT_HI_MASK)
/*! @} */

/*! @name SSC2 - TSI SSC register 2 */
/*! @{ */

#define TSI_SSC2_MOVE_REPEAT_NUM_MASK            (0x1FU)
#define TSI_SSC2_MOVE_REPEAT_NUM_SHIFT           (0U)
/*! MOVE_REPEAT_NUM - MOVE_REPEAT_NUM
 *  0b00000..The up_down counter will be updated for every sample-charge cycle.
 *  0b00001..The up_down counter will be updated for every 2 sample-charge cycles.
 *  0b00010..The up_down counter will be updated for every 3 sample-charge cycles.
 *  0b00011..The up_down counter will be updated for every 4 sample-charge cycles.
 *  0b00100..The up_down counter will be updated for every 5 sample-charge cycles.
 *  0b00101..The up_down counter will be updated for every 6 sample-charge cycles.
 *  0b00110..The up_down counter will be updated for every 7 sample-charge cycles.
 */
#define TSI_SSC2_MOVE_REPEAT_NUM(x)              (((uint32_t)(((uint32_t)(x)) << TSI_SSC2_MOVE_REPEAT_NUM_SHIFT)) & TSI_SSC2_MOVE_REPEAT_NUM_MASK)

#define TSI_SSC2_MOVE_STEPS_NUM_MASK             (0x700U)
#define TSI_SSC2_MOVE_STEPS_NUM_SHIFT            (8U)
/*! MOVE_STEPS_NUM - MOVE_STEPS_NUM
 *  0b000..The added value for up-down counter is 0.
 *  0b001..The added value for up-down counter is 1.
 *  0b010..The added value for up-down counter is 2.
 *  0b011..The added value for up-down counter is 3.
 *  0b100..The added value for up-down counter is 4.
 *  0b101..The added value for up-down counter is 5.
 *  0b110..The added value for up-down counter is 6.
 *  0b111..The added value for up-down counter is 7.
 */
#define TSI_SSC2_MOVE_STEPS_NUM(x)               (((uint32_t)(((uint32_t)(x)) << TSI_SSC2_MOVE_STEPS_NUM_SHIFT)) & TSI_SSC2_MOVE_STEPS_NUM_MASK)

#define TSI_SSC2_MOVE_NOCHARGE_MAX_MASK          (0x3F0000U)
#define TSI_SSC2_MOVE_NOCHARGE_MAX_SHIFT         (16U)
/*! MOVE_NOCHARGE_MAX - MOVE_NOCHARGE_MAX */
#define TSI_SSC2_MOVE_NOCHARGE_MAX(x)            (((uint32_t)(((uint32_t)(x)) << TSI_SSC2_MOVE_NOCHARGE_MAX_SHIFT)) & TSI_SSC2_MOVE_NOCHARGE_MAX_MASK)

#define TSI_SSC2_MOVE_NOCHARGE_MIN_MASK          (0xF0000000U)
#define TSI_SSC2_MOVE_NOCHARGE_MIN_SHIFT         (28U)
/*! MOVE_NOCHARGE_MIN - MOVE_NOCHARGE_MIN
 *  0b0000..The SSC output bit 1's min period will be (1 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycle of divided system clock.
 *  0b0001..The SSC output bit 1's min period will be (2 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of divided system clock.
 *  0b0010..The SSC output bit 1's min period will be (3 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of divided system clock.
 *  0b0011..The SSC output bit 1's min period will be (4 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of divided system clock.
 *  0b0100..The SSC output bit 1's min period will be (5 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of divided system clock.
 *  0b0101..The SSC output bit 1's min period will be (6 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of divided system clock.
 *  0b0110..The SSC output bit 1's min period will be (7 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of divided system clock.
 *  0b0111..The SSC output bit 1's min period will be (8 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of divided system clock.
 *  0b1000..The SSC output bit 1's min period will be (9 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of divided system clock.
 *  0b1001..The SSC output bit 1's min period will be (10 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of divided system clock.
 *  0b1010..The SSC output bit 1's min period will be (11 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of divided system clock.
 *  0b1011..The SSC output bit 1's min period will be (12 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of divided system clock.
 *  0b1100..The SSC output bit 1's min period will be (13 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of divided system clock.
 *  0b1101..The SSC output bit 1's min period will be (14 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of divided system clock.
 *  0b1110..The SSC output bit 1's min period will be (15 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of divided system clock.
 *  0b1111..The SSC output bit 1's min period will be (16 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of divided system clock.
 */
#define TSI_SSC2_MOVE_NOCHARGE_MIN(x)            (((uint32_t)(((uint32_t)(x)) << TSI_SSC2_MOVE_NOCHARGE_MIN_SHIFT)) & TSI_SSC2_MOVE_NOCHARGE_MIN_MASK)
/*! @} */

/*! @name SHIELD - TSI shield register */
/*! @{ */

#define TSI_SHIELD_SHIELD_SEL0_MASK              (0x1U)
#define TSI_SHIELD_SHIELD_SEL0_SHIFT             (0U)
/*! SHIELD_SEL0 - Selects shield channels.
 *  0b0..The channel is not configured as shield channel.
 *  0b1..The channel is configured as shield channel.
 */
#define TSI_SHIELD_SHIELD_SEL0(x)                (((uint32_t)(((uint32_t)(x)) << TSI_SHIELD_SHIELD_SEL0_SHIFT)) & TSI_SHIELD_SHIELD_SEL0_MASK)

#define TSI_SHIELD_SHIELD_SEL1_MASK              (0x2U)
#define TSI_SHIELD_SHIELD_SEL1_SHIFT             (1U)
/*! SHIELD_SEL1 - Selects shield channels.
 *  0b0..The channel is not configured as shield channel.
 *  0b1..The channel is configured as shield channel.
 */
#define TSI_SHIELD_SHIELD_SEL1(x)                (((uint32_t)(((uint32_t)(x)) << TSI_SHIELD_SHIELD_SEL1_SHIFT)) & TSI_SHIELD_SHIELD_SEL1_MASK)

#define TSI_SHIELD_SHIELD_SEL2_MASK              (0x4U)
#define TSI_SHIELD_SHIELD_SEL2_SHIFT             (2U)
/*! SHIELD_SEL2 - Selects shield channels.
 *  0b0..The channel is not configured as shield channel.
 *  0b1..The channel is configured as shield channel.
 */
#define TSI_SHIELD_SHIELD_SEL2(x)                (((uint32_t)(((uint32_t)(x)) << TSI_SHIELD_SHIELD_SEL2_SHIFT)) & TSI_SHIELD_SHIELD_SEL2_MASK)

#define TSI_SHIELD_SHIELD_SEL3_MASK              (0x8U)
#define TSI_SHIELD_SHIELD_SEL3_SHIFT             (3U)
/*! SHIELD_SEL3 - Selects shield channels.
 *  0b0..The channel is not configured as shield channel.
 *  0b1..The channel is configured as shield channel.
 */
#define TSI_SHIELD_SHIELD_SEL3(x)                (((uint32_t)(((uint32_t)(x)) << TSI_SHIELD_SHIELD_SEL3_SHIFT)) & TSI_SHIELD_SHIELD_SEL3_MASK)

#define TSI_SHIELD_SHIELD_SEL4_MASK              (0x10U)
#define TSI_SHIELD_SHIELD_SEL4_SHIFT             (4U)
/*! SHIELD_SEL4 - Selects shield channels.
 *  0b0..The channel is not configured as shield channel.
 *  0b1..The channel is configured as shield channel.
 */
#define TSI_SHIELD_SHIELD_SEL4(x)                (((uint32_t)(((uint32_t)(x)) << TSI_SHIELD_SHIELD_SEL4_SHIFT)) & TSI_SHIELD_SHIELD_SEL4_MASK)

#define TSI_SHIELD_SHIELD_SEL5_MASK              (0x20U)
#define TSI_SHIELD_SHIELD_SEL5_SHIFT             (5U)
/*! SHIELD_SEL5 - Selects shield channels.
 *  0b0..The channel is not configured as shield channel.
 *  0b1..The channel is configured as shield channel.
 */
#define TSI_SHIELD_SHIELD_SEL5(x)                (((uint32_t)(((uint32_t)(x)) << TSI_SHIELD_SHIELD_SEL5_SHIFT)) & TSI_SHIELD_SHIELD_SEL5_MASK)

#define TSI_SHIELD_SHIELD_SEL6_MASK              (0x40U)
#define TSI_SHIELD_SHIELD_SEL6_SHIFT             (6U)
/*! SHIELD_SEL6 - Selects shield channels.
 *  0b0..The channel is not configured as shield channel.
 *  0b1..The channel is configured as shield channel.
 */
#define TSI_SHIELD_SHIELD_SEL6(x)                (((uint32_t)(((uint32_t)(x)) << TSI_SHIELD_SHIELD_SEL6_SHIFT)) & TSI_SHIELD_SHIELD_SEL6_MASK)

#define TSI_SHIELD_SHIELD_SEL7_MASK              (0x80U)
#define TSI_SHIELD_SHIELD_SEL7_SHIFT             (7U)
/*! SHIELD_SEL7 - Selects shield channels.
 *  0b0..The channel is not configured as shield channel.
 *  0b1..The channel is configured as shield channel.
 */
#define TSI_SHIELD_SHIELD_SEL7(x)                (((uint32_t)(((uint32_t)(x)) << TSI_SHIELD_SHIELD_SEL7_SHIFT)) & TSI_SHIELD_SHIELD_SEL7_MASK)

#define TSI_SHIELD_SHIELD_SEL8_MASK              (0x100U)
#define TSI_SHIELD_SHIELD_SEL8_SHIFT             (8U)
/*! SHIELD_SEL8 - Selects shield channels.
 *  0b0..The channel is not configured as shield channel.
 *  0b1..The channel is configured as shield channel.
 */
#define TSI_SHIELD_SHIELD_SEL8(x)                (((uint32_t)(((uint32_t)(x)) << TSI_SHIELD_SHIELD_SEL8_SHIFT)) & TSI_SHIELD_SHIELD_SEL8_MASK)

