nxp-mcuxpresso/mcux-sdk/devices/MKE13Z9/MKE13Z9.h
#define TSI_SHIELD_SHIELD_SEL9_MASK              (0x200U)
#define TSI_SHIELD_SHIELD_SEL9_SHIFT             (9U)
/*! SHIELD_SEL9 - Selects shield channels.
 *  0b0..The channel is not configured as shield channel.
 *  0b1..The channel is configured as shield channel.
 */
#define TSI_SHIELD_SHIELD_SEL9(x)                (((uint32_t)(((uint32_t)(x)) << TSI_SHIELD_SHIELD_SEL9_SHIFT)) & TSI_SHIELD_SHIELD_SEL9_MASK)

#define TSI_SHIELD_SHIELD_SEL10_MASK             (0x400U)
#define TSI_SHIELD_SHIELD_SEL10_SHIFT            (10U)
/*! SHIELD_SEL10 - Selects shield channels.
 *  0b0..The channel is not configured as shield channel.
 *  0b1..The channel is configured as shield channel.
 */
#define TSI_SHIELD_SHIELD_SEL10(x)               (((uint32_t)(((uint32_t)(x)) << TSI_SHIELD_SHIELD_SEL10_SHIFT)) & TSI_SHIELD_SHIELD_SEL10_MASK)

#define TSI_SHIELD_SHIELD_SEL11_MASK             (0x800U)
#define TSI_SHIELD_SHIELD_SEL11_SHIFT            (11U)
/*! SHIELD_SEL11 - Selects shield channels.
 *  0b0..The channel is not configured as shield channel.
 *  0b1..The channel is configured as shield channel.
 */
#define TSI_SHIELD_SHIELD_SEL11(x)               (((uint32_t)(((uint32_t)(x)) << TSI_SHIELD_SHIELD_SEL11_SHIFT)) & TSI_SHIELD_SHIELD_SEL11_MASK)

#define TSI_SHIELD_SHIELD_SEL12_MASK             (0x1000U)
#define TSI_SHIELD_SHIELD_SEL12_SHIFT            (12U)
/*! SHIELD_SEL12 - Selects shield channels.
 *  0b0..The channel is not configured as shield channel.
 *  0b1..The channel is configured as shield channel.
 */
#define TSI_SHIELD_SHIELD_SEL12(x)               (((uint32_t)(((uint32_t)(x)) << TSI_SHIELD_SHIELD_SEL12_SHIFT)) & TSI_SHIELD_SHIELD_SEL12_MASK)

#define TSI_SHIELD_SHIELD_SEL13_MASK             (0x2000U)
#define TSI_SHIELD_SHIELD_SEL13_SHIFT            (13U)
/*! SHIELD_SEL13 - Selects shield channels.
 *  0b0..The channel is not configured as shield channel.
 *  0b1..The channel is configured as shield channel.
 */
#define TSI_SHIELD_SHIELD_SEL13(x)               (((uint32_t)(((uint32_t)(x)) << TSI_SHIELD_SHIELD_SEL13_SHIFT)) & TSI_SHIELD_SHIELD_SEL13_MASK)

#define TSI_SHIELD_SHIELD_SEL14_MASK             (0x4000U)
#define TSI_SHIELD_SHIELD_SEL14_SHIFT            (14U)
/*! SHIELD_SEL14 - Selects shield channels.
 *  0b0..The channel is not configured as shield channel.
 *  0b1..The channel is configured as shield channel.
 */
#define TSI_SHIELD_SHIELD_SEL14(x)               (((uint32_t)(((uint32_t)(x)) << TSI_SHIELD_SHIELD_SEL14_SHIFT)) & TSI_SHIELD_SHIELD_SEL14_MASK)

#define TSI_SHIELD_SHIELD_SEL15_MASK             (0x8000U)
#define TSI_SHIELD_SHIELD_SEL15_SHIFT            (15U)
/*! SHIELD_SEL15 - Selects shield channels.
 *  0b0..The channel is not configured as shield channel.
 *  0b1..The channel is configured as shield channel.
 */
#define TSI_SHIELD_SHIELD_SEL15(x)               (((uint32_t)(((uint32_t)(x)) << TSI_SHIELD_SHIELD_SEL15_SHIFT)) & TSI_SHIELD_SHIELD_SEL15_MASK)

#define TSI_SHIELD_SHIELD_SEL16_MASK             (0x10000U)
#define TSI_SHIELD_SHIELD_SEL16_SHIFT            (16U)
/*! SHIELD_SEL16 - Selects shield channels.
 *  0b0..The channel is not configured as shield channel.
 *  0b1..The channel is configured as shield channel.
 */
#define TSI_SHIELD_SHIELD_SEL16(x)               (((uint32_t)(((uint32_t)(x)) << TSI_SHIELD_SHIELD_SEL16_SHIFT)) & TSI_SHIELD_SHIELD_SEL16_MASK)

#define TSI_SHIELD_SHIELD_SEL17_MASK             (0x20000U)
#define TSI_SHIELD_SHIELD_SEL17_SHIFT            (17U)
/*! SHIELD_SEL17 - Selects shield channels.
 *  0b0..The channel is not configured as shield channel.
 *  0b1..The channel is configured as shield channel.
 */
#define TSI_SHIELD_SHIELD_SEL17(x)               (((uint32_t)(((uint32_t)(x)) << TSI_SHIELD_SHIELD_SEL17_SHIFT)) & TSI_SHIELD_SHIELD_SEL17_MASK)

#define TSI_SHIELD_SHIELD_SEL18_MASK             (0x40000U)
#define TSI_SHIELD_SHIELD_SEL18_SHIFT            (18U)
/*! SHIELD_SEL18 - Selects shield channels.
 *  0b0..The channel is not configured as shield channel.
 *  0b1..The channel is configured as shield channel.
 */
#define TSI_SHIELD_SHIELD_SEL18(x)               (((uint32_t)(((uint32_t)(x)) << TSI_SHIELD_SHIELD_SEL18_SHIFT)) & TSI_SHIELD_SHIELD_SEL18_MASK)

#define TSI_SHIELD_SHIELD_SEL19_MASK             (0x80000U)
#define TSI_SHIELD_SHIELD_SEL19_SHIFT            (19U)
/*! SHIELD_SEL19 - Selects shield channels.
 *  0b0..The channel is not configured as shield channel.
 *  0b1..The channel is configured as shield channel.
 */
#define TSI_SHIELD_SHIELD_SEL19(x)               (((uint32_t)(((uint32_t)(x)) << TSI_SHIELD_SHIELD_SEL19_SHIFT)) & TSI_SHIELD_SHIELD_SEL19_MASK)

#define TSI_SHIELD_SHIELD_SEL20_MASK             (0x100000U)
#define TSI_SHIELD_SHIELD_SEL20_SHIFT            (20U)
/*! SHIELD_SEL20 - Selects shield channels.
 *  0b0..The channel is not configured as shield channel.
 *  0b1..The channel is configured as shield channel.
 */
#define TSI_SHIELD_SHIELD_SEL20(x)               (((uint32_t)(((uint32_t)(x)) << TSI_SHIELD_SHIELD_SEL20_SHIFT)) & TSI_SHIELD_SHIELD_SEL20_MASK)

#define TSI_SHIELD_SHIELD_SEL21_MASK             (0x200000U)
#define TSI_SHIELD_SHIELD_SEL21_SHIFT            (21U)
/*! SHIELD_SEL21 - Selects shield channels.
 *  0b0..The channel is not configured as shield channel.
 *  0b1..The channel is configured as shield channel.
 */
#define TSI_SHIELD_SHIELD_SEL21(x)               (((uint32_t)(((uint32_t)(x)) << TSI_SHIELD_SHIELD_SEL21_SHIFT)) & TSI_SHIELD_SHIELD_SEL21_MASK)

#define TSI_SHIELD_SHIELD_SEL22_MASK             (0x400000U)
#define TSI_SHIELD_SHIELD_SEL22_SHIFT            (22U)
/*! SHIELD_SEL22 - Selects shield channels.
 *  0b0..The channel is not configured as shield channel.
 *  0b1..The channel is configured as shield channel.
 */
#define TSI_SHIELD_SHIELD_SEL22(x)               (((uint32_t)(((uint32_t)(x)) << TSI_SHIELD_SHIELD_SEL22_SHIFT)) & TSI_SHIELD_SHIELD_SEL22_MASK)

#define TSI_SHIELD_SHIELD_SEL23_MASK             (0x800000U)
#define TSI_SHIELD_SHIELD_SEL23_SHIFT            (23U)
/*! SHIELD_SEL23 - Selects shield channels.
 *  0b0..The channel is not configured as shield channel.
 *  0b1..The channel is configured as shield channel.
 */
#define TSI_SHIELD_SHIELD_SEL23(x)               (((uint32_t)(((uint32_t)(x)) << TSI_SHIELD_SHIELD_SEL23_SHIFT)) & TSI_SHIELD_SHIELD_SEL23_MASK)

#define TSI_SHIELD_SHIELD_SEL24_MASK             (0x1000000U)
#define TSI_SHIELD_SHIELD_SEL24_SHIFT            (24U)
/*! SHIELD_SEL24 - Selects shield channels.
 *  0b0..The channel is not configured as shield channel.
 *  0b1..The channel is configured as shield channel.
 */
#define TSI_SHIELD_SHIELD_SEL24(x)               (((uint32_t)(((uint32_t)(x)) << TSI_SHIELD_SHIELD_SEL24_SHIFT)) & TSI_SHIELD_SHIELD_SEL24_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group TSI_Register_Masks */


/* TSI - Peripheral instance base addresses */
/** Peripheral TSI0 base address */
#define TSI0_BASE                                (0x40045000u)
/** Peripheral TSI0 base pointer */
#define TSI0                                     ((TSI_Type *)TSI0_BASE)
/** Array initializer of TSI peripheral base addresses */
#define TSI_BASE_ADDRS                           { TSI0_BASE }
/** Array initializer of TSI peripheral base pointers */
#define TSI_BASE_PTRS                            { TSI0 }
/** Interrupt vectors for the TSI peripheral type */
#define TSI_IRQS                                 { TSI0_IRQn }

/*!
 * @}
 */ /* end of group TSI_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- UART Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup UART_Peripheral_Access_Layer UART Peripheral Access Layer
 * @{
 */

